placeholder/dbl_0_17_1-00900_9/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          10;
        startFace       12946;
    }
    outlet
    {
        type            patch;
        nFaces          10;
        startFace       12956;
    }
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          446;
        startFace       12966;
    }
    baffle
    {
        type            wall;
        inGroups        1(wall);
        nFaces          34;
        startFace       13412;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          6598;
        startFace       13446;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          6598;
        startFace       20044;
    }
)

// ************************************************************************* //
